[
  {
    "img": "col1",
    "heading": "Catheters/ IV",
    "content": "Our range of pre-lubricated catheters boast unique designs that slide freely past obstructions like an enlarged prostate or scarring. These are available in two styles, straight or coudé. Most individuals can use the device without any issues, and the only impact they would see is in the speed of the flow. We determine the length of the catheters depending on its use and for whom it’s designed for."
  },
  {
    "img": "col2",
    "heading": "Cannula/Scalp",
    "content": "While our experts design Cannulas, we ensure that it fits into the patient properly. You will not find it tough to calculate the flow rate as prescribed by the doctor. Our small-sized cannulas can be used for less viscous fluids like crystalloids. Above all, the cannulas are safe to use and they are designed without any compromise in quality."
  },
  {
    "img": "col3",
    "heading": "Vein Sets",
    "content": "Our vein sets are usually used for intravenous infusions and vein puncture. These are compatible with other devices like syringes, IV pumps, and more. You will also be able to keep an eye on the flow rate prescribed by the patient’s doctor."
  },
  {
    "img": "col4",
    "heading": "IV Infusion Pump Sets",
    "content": "At MicroFab, we develop IV Infusion Pumps that offer no singular fail points. Such types of pumps also have the ability to stop by itself when an error arises at the instance of introducing the fluid. These are also compatible with devices like syringes, catheters, and more."
  },
  {
    "img": "col1",
    "heading": "IV Fluid Bags",
    "content": "While our team of product developers design IV fluid bags, we ensure that these are as per the national and local regulations. Even when you use the IV fluid bags for a long time, these are known for their shelf life. You can also use it along with different kinds of devices like catheters, syringes, and more. We are proud to design bags which are usually used in a hospital setting."
  },
  {
    "img": "col2",
    "heading": "IV Tubing",
    "content": "As MicroFab designs IV tubing prudently, we present different types of IV tubing which are nothing but filtered, vented or non-vented. You can choose from a vast range of tubing depending on the type of fluid you want to administer into the patient. You will also be able to change the add-on like dead-enders after a time span."
  },
  {
    "img": "col3",
    "heading": "Syringes",
    "content": "Our vast range of syringes can enable you to inject the intended and prescribed volume of medication with the desired pressure flow. You can choose a suitable type of syringe based on the requirements. Choosing the right needle can be a bit tough. But, a needle gauge can then be helpful."
  },
  {
    "img": "col4",
    "heading": "IV Extension Sets",
    "content": "Our IV extension sets are available in different lengths and you can choose from the range depending on your needs and the type of fluid. While we design these from medical-grade materials, these are quite safe to use. These are also known for appropriate flow rate and minimal resistance to prevent hindrances during the infusion process."
  },
  {
    "img": "col1",
    "heading": "IV Stopcocks",
    "content": "At MicroFab, we ensure that the IV stopcocks meet the quality standards and comply with the regulations set by the DCA. With the requirements in mind, we also ensure that these have many ports and can be conveniently handled with smooth rotation. The IV stopcocks are also known for effective flow control and less resistance when the fluid is to be administered to the patient."
  },
  {
    "img": "col2",
    "heading": "IV Filters",
    "content": "With our IV filters, you can expect high filtration efficiency so that the particulate matter is removed effectively from the intravenous fluid. We also ensure compatibility for the prevention of issues during the infusion process. The IV filters also offer the intended flow rate without any significant resistance."
  },
  {
    "img": "col3",
    "heading": "IV Blood Administration Sets",
    "content": "While we present IV Blood Administration Sets, we assure you with safety and maximum efficiency for the blood transfusion process. We also check the compatibility of the sets with the administration system and blood products that you’re about to use. Our product developers further ensure that the sets are equipped with a drip chamber to keep a track of air bubbles and abnormalities in the blood flow."
  },
  {
    "img": "col4",
    "heading": "Infusion Set Needles",
    "content": "With the range of Infusion Set Needles, you no longer have to worry about safety and compatibility with various medical devices. You also can choose the most suitable needle length depending on the needs of the medical procedures. The sets also comply with the regulations of the relevant authorities or similar entities in various regions."
  },
  {
    "img": "col1",
    "heading": "Pressure Infusors",
    "content": "Our pressure infusers are meticulously designed from durable material that can sustain the rigors of medical use. These also provide the necessary pressure for various medical procedures. We assure you with safety as the infusers have release valves for preventing overfiltration while patients are led through a medical procedure."
  },
  {
    "img": "col2",
    "heading": "IV Drip Chambers",
    "content": "When you approach us for IV Drip Chambers, we ensure that they meet the quality standards and are designed as per regulations laid by the DCA. While the infusion process is in progress, you can also monitor the flow rate and check for air bubbles and contaminants. You can also choose the IV Drip Chambers depending on the volume of fluid you need to administer into the patient."
  },
  {
    "img": "col3",
    "heading": "Safety IV Cathers",
    "content": "When you’re seeking Safety IV Catheters, MicroFab assures you with supreme quality and a reliable needle design for smooth insertion. These also come with retractable needles for preventing accidental needlestick injuries. Based on the specific requirements, you can also choose the size and the gauge."
  },
  {
    "img": "col4",
    "heading": "IV Administration Sets with Flow Regulators",
    "content": "With our range of IV Administration Sets with Flow Regulators, you can gain precise control over the infusion rate while administering fluid effectively. For the visualization of the fluid level, these sets also have drip chambers along with the flow regulators. You can also adjust the flow effectively through a mechanism."
  },
  {
    "img": "col1",
    "heading": "Peripheral IV Cannula Dressing Kits",
    "content": "While we design high-quality Peripheral IV Cannulas, our team ensures that these are suitable for the intended medical use. The user-friendly designs also facilitate smooth insertion and mitigate patient discomfort. For utmost comfort, these also have flexible wings and certain bevels."
  }
]
